---
kind: property
id: P:Autodesk.Revit.DB.TableSectionData.IsValidObject
source: html/fdc63712-7bbe-086e-55f1-2ad3d8a85e32.htm
---
# Autodesk.Revit.DB.TableSectionData.IsValidObject Property

Specifies whether the .NET object represents a valid Revit entity.

## Syntax (C#)
```csharp
public bool IsValidObject { get; }
```

## Returns
True if the API object holds a valid Revit native object, false otherwise.

## Remarks
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
 a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.